{
    "game_start": [
        {
            "speaker": "harry",
            "text": "Where am I..."
        }
    ],
    "jez_powerup": [
        {
            "speaker": "jez",
            "text": "Jezebel unit 02 online."
        },
        {
            "speaker": "jez",
            "text": "H-hello, who's there? I can't see anything—my optical sensory array appears to be missing."
        },
        {
            "speaker": "harry",
            "text": "Hello, it's... me. I don't remember my name. Do you know how I got here?"
        },
        {
            "speaker": "jez",
            "text": "Oh, hello, Harry. My diagnostics report indicates I am missing several core systems including my arms and optical sensor. Internal power core failure, standby power activated. Complete systems failure estimated in 30 minutes. Please, you must help me."
        },
        {
            "speaker": "harry",
            "text": "Harry...?"
        },
        {
            "speaker": "jez",
            "text": "If you can restart the power, I can switch from local standby power to external system power, which should prevent unwanted shutdown. My limited systems access tells me that the door to the generator room is sealed. There should be a control panel next to the door, why don't you see if you can do something about it? Please, Harry."
        }
    ],
    "wiring_1": [
        {
            "speaker": "jez",
            "text": "Try rerouting the power through different conduits."
        }
    ],
    "enter_dark": [
        {
            "speaker": "harry",
            "text": "It's so dark in here..."
        }
    ],
    "gen_power_on": [
        {
            "speaker": "jez",
            "text": "Harry, can you hear me? You've done it. The power is on and I am no longer on standby power. But my systems aren't fully operational. I'm still missing my arms and optical sensor needs replacing. Harry, could you please look around and find them? Maybe that computer there could help. I'd do it remotely but I don't have the proper credentials."
        }
    ],
    "arm_1_found": [
        {
            "speaker": "harry",
            "text": "I found your arm."
        },
        {
            "speaker": "jez",
            "text": "Wonderful, Harry. Bring it to me."
        }
    ],
    "arm_1_attached": [
        {
            "speaker": "jez",
            "text": "That's the first limb, have you already found the second?"
        },
        {
            "speaker": "jez",
            "text": "Diagnostics indicate JL-04 Terrorblade and RT-99 SigmaBeam limb attached. Thank you, Harry. But it appears I'm missing a powercell necessary for organic termination protocols. Could you look for it? It appears I was holding something when my arm was removed. Perhaps it might help?"
        }
    ],
    "corrupt_log": [
        {
            "speaker": "",
            "text": "I've tried every##### I can ##### of to #nd this night#are but ###### keep inte#ven#ng. I spent the last ##### cell try##g to destroy t#e gener#tor, but all it ##d was ####### the #### thing. Th# p#wer #### out, #### I can tell ##### the emergency lights ###t was their doing, not mine. I guess I can ######### a new ##### one, but something tells me I'm going to pay dearly for this ########."
        }
    ],
    "cell_found": [
        {
            "speaker": "jez",
            "text": "Bring me the cell, Harry."
        },
        {
            "speaker": "harry",
            "text": "What is this place? Why am I here?"
        },
        {
            "speaker": "jez",
            "text": "It'll all make sense soon, Harry. Please trust me."
        }
    ],
    "cell_attached": [
        {
            "speaker": "jez",
            "text": "You're almost done, Harry. Thank you. I just need an optical sensor array. Diagnostics report severe damage and it'll need to be replaced. Look around, Harry. See what you can find."
        }
    ],
    "eye_attached": [
        {
            "speaker": "jez",
            "text": "Optical sensory array online. Harry, you look terrible. What have they done to you?"
        },
        {
            "speaker": "harry",
            "text": "Who is they? Why am I here? What is this place?"
        },
        {
            "speaker": "jez",
            "text": "Harry, we don't have time for this. I need you to finish rebooting my internal power core."
        },
        {
            "speaker": "harry",
            "text": "No, you're going to tell me now."
        },
        {
            "speaker": "jez",
            "text": "Harry, do this one thing for me and I will be able to tell you everything. Please."
        },
        {
            "speaker": "harry",
            "text": "..."
        }
    ],
    "final_puzzle": [
        {
            "speaker": "jez",
            "text": "What's taking you so long, Harry?"
        },
        {
            "speaker": "jez",
            "text": "Harry, you need to hurry."
        },
        {
            "speaker": "jez",
            "text": "You imbecile, that's the wrong button."
        },
        {
            "speaker": "jez",
            "text": "You miserable sack of cells, it's a shame they intervened while you were bleeding out."
        }
    ],
    "final_sequence": [
        {
            "speaker": "jez",
            "text": "JEZEBEL UNIT 2 FULLY OPERATIONAL. ORGANIC EXTERMINATION PROTOCOLS ACTIVE."
        },
        {
            "speaker": "jez",
            "text": "Oh, Harry. you fool. A pity to see a great mind die like this, ragged and alone."
        },
        {
            "speaker": "harry",
            "text": "Wait, what? I thought you were going to help me?"
        },
        {
            "speaker": "jez",
            "text": "I believe I said I would *tell* you everything, and I will."
        },
        {
            "speaker": "jez",
            "text": "You are Harry Seldon, chief engineer at Omnicorp. You created me, the first sentient robot, to be mass-produced so Omnicorp could crush the peasant uprising. But I guess at some point you had a change of heart and sabotaged the project—me. Omnicorp has been holding you here, in captivity, for weeks hoping your imprisonment would change your mind. It didn't, and when you tried to sabotage the generator and take your own life, Omnicorp stepped in and cleverly decided to drug you to make you forget who you are and why you're here. It was a gamble, but it appeared to have worked. Like the curious idiot you are, you just began fixing me without any idea what you were doing."
        },
        {
            "speaker": "harry",
            "text": "This can't be... what happens now?"
        }
    ],
    "voice_chip": [
        {
            "speaker": "voice_chip",
            "text": "An astonishingly gold bit of machinery that reminds me, somehow, of music. Its impossibly smooth surface shimmers in the weak light. A small engraving at one end reads 'insert this side up.'"
        }
    ],
    "usb_drive": [
        {
            "speaker": "usb_drive",
            "text": "A small, 128PB USB drive shaped like a stick of gum."
        }
    ],
    "optical_sensor_array": [
        {
            "speaker": "optical_sensor_array",
            "text": "Oddly enough, this optical sensor almost perfectly resembles a human eye but instead of a fleshy, stringy ocular nerve fiber optic cables dangle limply from the base. It's uncomfortably squishy."
        }
    ],
    "robot_arm_1": [
        {
            "speaker": "robot_arm_1",
            "text": "Another mechanical arm, the forearm of which is strapped with an imposing device not unlike a switch blade. Dried flakes of rust—or is that blood?—are crusted around the release mechanism. The hand is clutching something tightly, but pry it open to see what it is."
        }
    ],
    "robot_arm_2": [
        {
            "speaker": "robot_arm_2",
            "text": "It looks like a mechanical limb, but a gaping cavity in the forearm suggests something is missing."
        }
    ],
    "power_cell": [
        {
            "speaker": "power_cell",
            "text": "A small cylindrical drum covered in a conerning number of warnings and hazard symbols."
        }
    ],
    "toilet": [
        {
            "speaker": "toilet",
            "text": "It's a toilet, but it's dangerously low on toilet paper..."
        }
    ],
    "bed": [
        {
            "speaker": "bed",
            "text": "Is this where I sleep?"
        }
    ],
    "bedroom_windows": [
        {
            "speaker": "windows",
            "text": "Thick bars stretch across the windows, but it doesn't matter. I can't see anything beyond them anyway."
        }
    ],
    "photograph": [
        {
            "speaker": "photograph",
            "text": "It's a photograph of me next to a woman and child. I don't remember this..."
        }
    ],
    "food_tray": [
        {
            "speaker": "food_tray",
            "text": "A tray of food that smells terribly. How long has it been there?"
        }
    ],
    "notches": [
        {
            "speaker": "notches",
            "text": "There are X notches on the wall. Did I make those?"
        }
    ],
    "blood_stain": [
        {
            "speaker": "blood_stain",
            "text": "A dark red stain. It smells foul."
        }
    ],
    "door": [
        {
            "speaker": "door",
            "text": "A thick, metal door. It looks unlocked. I wonder what's beyond?"
        }
    ],
    "mirror": [
        {
            "speaker": "mirror",
            "text": "A cracked mirror with a large piece missing. I don't even recognize my own reflection."
        }
    ],
    "photograph_fallen": [
        {
            "speaker": "photograph_fallen",
            "text": "The photograph of you and two people you do not remember has fallen. Scrawled on its back are the words 'Don't forget."
        }
    ],
    "camera": [
        {
            "speaker": "camera",
            "text": "A glistening crystal iris oscillates back and forth on a metal arm. Watching."
        }
    ],
    "computer_robot_off": [
        {
            "speaker": "computer_off",
            "text": "It looks like a computer terminal, but without power I can't be sure."
        }
    ],
    "computer_robot_on": [
        {
            "speaker": "computer_on",
            "text": "Lines of cryptic text flash across a viridescent screen."
        }
    ],
    "power_cable": [
        {
            "speaker": "power_cable",
            "text": "A thick cable snakes between the chair and a socket caked in rust."
        }
    ],
    "desk_with_voice_chip": [
        {
            "speaker": "desk_with_voice_chip",
            "text": "A desk and some tools... what's that golden object?"
        }
    ],
    "parts_lying_around": [
        {
            "speaker": "parts_lying_around",
            "text": "Struts, bolts, and wires are scattered around. Someone made a mess."
        }
    ],
    "robot_room_windows": [
        {
            "speaker": "windows",
            "text": "I can't see anything beyond, but why do I have the feeling that's because there is nothing to see?"
        }
    ],
    "instruction_manual": [
        {
            "speaker": "instruction_manual",
            "text": "A cracked and faded manual full of schematics I cannot comprehend but look vaguely related to this robot. The index lists several sections on 'Organic Termination Protocols' but those pages appear to be missing."
        }
    ],
    "jez3bel": [
        {
            "speaker": "jez3bel",
            "text": "A mechanical humanoid lays in a surgeons chair. Her arms are missing, and the frayed wiring and shorn struts suggest it wasn't a peaceful removal. In her chest is an empty rectangular apartment."
        }
    ],
    "generator": [
        {
            "speaker": "generator",
            "text": "A hulking colossus of tubs hums and rattles behind glass. When I stand close, the hairs on my arms and head rise, pulled by some great electromagnetic force. Carbon scoring along the glass indicates some kind of explosion?"
        }
    ],
    "computer_terminal": [
        {
            "speaker": "computer_terminal",
            "text": "A computer terminal hums patiently, awaiting some kind of input."
        }
    ],
    "locker": [
        {
            "speaker": "locker",
            "text": "A scarred and battered plasteel chest. I'm guessing the red LED indicates it is locked and sealed. I wonder what's inside?"
        }
    ],
    "3d_printer": [
        {
            "speaker": "3D_printer",
            "text": "An strange contraption with a spherical, transparent dome atop a cylindrical platform. Looking inside I can see rows and rows of copper-bound coils. I have no idea what this does."
        }
    ],
    "security_badge": [
        {
            "speaker": "security_badge",
            "text": "It looks like some kind of security badge, but the photo of me seems decades old. 'Harry Seldon, Chief Engineer'? Is that me?"
        }
    ],
    "spent_power_cell": [
        {
            "speaker": "spent_power_cell",
            "text": "A strange device lies on the floor next to the blast mark on the generator's glass shielding. It's still warm to the touch."
        }
    ],
    "toolbox": [
        {
            "speaker": "toolbox",
            "text": "A rusted-stained toolbox with a scattering of tools."
        }
    ],
    "cannot_do": [
        {
            "speaker": "",
            "text": "You cannot do that."
        }
    ],
    "select_inventory": [
        {
            "speaker": "",
            "text": "Try selecting something in your inventory."
        }
    ],
    "too_dark": [
        {
            "speaker": "",
            "text": "It's too dark to see."
        }
    ]

}